{"inkVersion":20,"root":[[{"#":"Name Isaac"},{"#":"sprite basic"},"^U-um excuse me, can I ask you something?","\n",{"#":"name Hanae"},{"#":"sprite surprised"},"^Huh? Are you asking for me?","\n",{"#":"name Isaac"},{"#":"sprite basic"},"^Y-yeah. You're the Royal Flower Picker, from the capital right? I heard you Flower Pickers are really good at choosing and picking flowers right?","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^Yup! Spent a year in training and reading a lot of books on different types of plants and flowers.","\n",{"#":"name Hanae"},{"#":"sprite happy"},"^Do you want me to pick some flowers for you?","\n",{"#":"Name Isaac"},{"#":"sprite happy"},"^U-um yeah. My name is Isaac. You see, there's a boquet I want to make for somebody. But I don't know which flowers to choose, I'm not really knowledgeable when it comes to plants.","\n",{"#":"name Hanae"},{"#":"sprite Basic"},"^Sure! I would love to help. Who is this boquet for?","\n",{"#":"name Isaac"},{"#":"sprite bashful"},"^U-um, y-you see, it's um...well, f-for this girl","\n",{"#":"name Isaac"},{"#":"sprite bashful"},"^T-this u-um girl, well, y-you see, um-","\n",{"#":"name Hanae"},{"#":"sprite surprised"},"^(He seems really shy about the topic, I'll try not to go deeper into this)","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^Don't worry, I think I got an idea. It's for a person you really care about right? I know what flowers to get for her.","\n",{"#":"name Isaac"},{"#":"sprite happy"},"^You do? That's good to hear.","\n",{"#":"name Isaac"},{"#":"sprite bashful"},"^I'm not good at expressing my thoughts. I tend to stumble on my words a lot.","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^It's ok, flowers make a good symbol of one's feelings","\n",{"#":"name Isaac"},{"#":"sprite bashful"},"^One's feelings? I guess I can see that?","\n",{"#":"name Hanae"},{"#":"sprite happy"},"^Of course! Alright, for starters, let's get some yellow flowers. They represent closeness and friendship.","\n",{"#":"name Isaac"},{"#":"sprite happy"},"^That sounds good. You can find some yellow flowers near the front of the village or to the far east, most right side of the village.","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^Ok! I'll be back and pick some flowers for the boquet.","\n",{"#":"name Isaac"},{"#":"sprite happy"},"^T-thank you.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}