{"inkVersion":20,"root":[[{"->":"Begin"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Begin":[[{"#":"Name Anko"},{"#":"Sprite Basic"},"^Hi there mam, my name is Anko, it's been awhile since we had a visitor come to our village.","\n",{"#":"Name Anko"},{"#":"Sprite Happy"},"^Let alone a Royal Flower Picker! Wowie, never would of imagined someone so important to come to our small village.","\n",{"#":"Name Anko"},{"#":"Sprite Happy"},"^I've heard of the stories of how Flower Pickers go out and help anyone in need. Because they are blessed by the Goddess Flora, any flower they pick has amazing powers.","\n",{"#":"Name Hanae"},{"#":"Sprite Happy"},"^Hi Anko, I'm Hanae.","\n",{"#":"Name Hanae"},{"#":"Sprite Basic"},"^And you are correct, I received the blessing of Flora and was appointed by the king himself to help this village.","\n",{"#":"name Hanae"},"^Any flower I pick will have special properties. From making potions, to medicine, or even being used in food.","\n",{"#":"Name Anko"},{"#":"Sprite Happy"},"^That's so cool! I always loved looking at flowers!","\n",{"#":"Name Anko"},{"#":"Sprite Sad"},"^Sadly, our land became dry and there hasn't been any flowers growing lately. The grass became orange and the plants became all droopy.","\n",{"#":"Name Anko"},"^I think because of that, we haven't had any new visitors come in awhile.","\n",{"#":"Name Hanae"},{"#":"sprite Basic"},"^I believe I can help with that. As a Royal Flower Picker, I can plant flowers to make harvesting easier, thus should bring life back to the area.","\n",{"#":"Name Anko"},{"#":"Sprite Happy"},"^Whoa really!","\n",{"#":"Name Anko"},{"#":"sprite sad"},"^Everyone in the village has been kinda sad because the land looks so sad.","\n",{"#":"Name Anko"},{"#":"sprite basic"},"^Maybe if we bring back flowers to decorate our village, we could make it pretty for everyone. That way, Mama and Papa, Uncle Jeffery, and the rest of the village won't look so sad all the time.","\n",{"#":"Name Hanae"},{"#":"Sprite Happy"},"^I'll be glad to help. It is my job afterall.","\n",{"#":"Name Anko"},{"#":"sprite happy"},"^Great! Let's first start by gathering some pink flowers.","\n",{"#":"Name Hanae"},{"#":"sprite basic"},"^I will get right on it! I think I can gather some pink flowers at the front of the village.","\n",["end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"#f":1}],"listDefs":{}}