{"inkVersion":20,"root":[[{"#":"name John"},{"#":"sprite basic"},"^Hey kid, I see you got the Purple flowers.","\n",{"#":"name Hanae"},{"#":"sprite happy"},"^Yup!","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^Do you need help with making the arrangement?","\n",{"#":"name John"},{"#":"sprite basic"},"^No need. I know how to make myself a basic arrangement.","\n",{"#":"name john"},{"#":"sprite basic"},"^But if you want, you can come meet me at the graveyard tomorrow. I'll have the flowers ready by then.","\n",{"#":"name John"},{"#":"sprite happy"},"^So you get to say hello to my wife and daughter. With all the help you've done around the village, I'm sure they'll be happy to see you send them off.","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^I love that idea, I'll be sure meet you there.","\n",{"#":"name Hanae"},{"#":"sprite sad"},"^Still, I'm really sorry to hear what happen to your wife and daughter.","\n",{"#":"name John"},{"#":"sprite basic"},"^Like I said kid, it ain't your fault.","\n",{"#":"name Hanae"},{"#":"sprite sad"},"^B-but, if only I became a Royal Flower Picker sooner, maybe I could have picked some medicinal flowers to help with their illness.","\n",{"#":"name John"},{"#":"sprite basic"},"^Well, there's not much you can do now. Who knows, maybe you would have been assigned to a different village entirely. It's not much use thinking about it, only what you could do moving foward.","\n",{"#":"name John"},{"#":"sprite basic"},"^You only got assigned here because of how dire our situation is here.","\n",{"#":"name Hanae"},{"#":"sprite sad"},"^I know, but still....","\n",{"#":"name John"},{"#":"sprite basic"},"^.....","\n",{"#":"name John"},{"#":"sprite basic"},"^Just do whatever is in your power and help as many people as you can in your reach.","\n",{"#":"name John"},{"#":"sprite happy"},"^Just like what you've done for this village.","\n",{"#":"name Hanae"},{"#":"sprite basic"},"^Mr. John....","\n",{"#":"name Hanae"},{"#":"sprite happy"},"^Thanks. Ok, I'll meet you tomorrow at the graveyard.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}